





const tips_obj = {
  owl: '為什麼領角鴞會飛，還是會被路殺呢？這是因為領角鴞的起飛角度較低，無法垂直起飛，因此在飛越馬路時，還沒飛到很高的高度就被車撞死了；另一方面，牠們的幼鳥在學飛階段很容易掉落在地上，又因飛行能力不佳，於是成為車下亡魂。',
  tiger: '臺灣原來存在著兩種貓科動物：雲豹和石虎，然雲豹已滅絕，因此石虎成為台灣最後的野生貓科動物。如今，由於道路開入淺山地區，使得石虎有機會進入路面並遭到車輛撞擊。在遍布丘陵地、石虎數量較多的苗栗縣，就經常發生石虎車禍致死事件。公路單位已在高速公路特定路段設置隔離網和生態廊道，但在一般道路上，石虎路死事件仍層出不窮。對於數量稀少的石虎來說，每一次事件都是重大損失，僅剩不到500隻的族群數量，專家預估會在百年內滅絕。',
  butterfly: '紫斑蝶屬於熱帶蝶種，活動溫度在15°C以上，而台灣正是全世界紫斑蝶分布最北的國家。台灣以南的國家，冬天不冷，紫斑蝶不需要遷移，而北迴歸線將台灣劃分成熱帶與亞熱帶氣候，形成了台灣紫斑蝶南下度冬的獨特現象，形成了壯觀的「紫蝶幽谷」。每年紫斑蝶會依循固定路線離開越冬棲地，從茂林開始，經過寶來、月世界、台南曾文水庫、彰化八卦山、台中大肚山、再到苗栗竹南海邊，路線卻正好與國道三號垂直相交，因此容易被撞死。',
  crab: '奧氏後相手蟹的繁殖季受雨季及月亮影響，每年農曆5~9月期間，每月月底的23至29日會有大量聚集降海釋幼行為，在墾丁香蕉灣、港口溪溪口及綠島龜灣，都是主要受路殺威脅的物種。母蟹待卵成熟時，依著月亮潮汐決定釋幼時間，此時，母蟹會抱著許多卵橫跨馬路，從山邊走向海岸「釋幼」，滿抱著卵的母蟹，只要一碰到海水就會一直抖動，破卵而出的小螃蟹們便會誕生，由於體積小，又在夜晚出沒，遊客一不注意便會壓死這些陸蟹。',
  turtle: '斑龜是臺灣體型最大的淡水龜，雌龜體型較大，背甲可長達27公分，雄龜背甲約20公分。4-6月為繁殖季，雌龜在產卵時才會上岸。交配後的雌龜會爬上岸尋找適合產卵的鬆軟沙地，從挖坑、產卵、埋卵，要花好幾個鐘頭。雌龜產完卵常會在岸上停留一段時間，再回到池中。因為斑龜生活區域常與人類活動區域重疊，很容易受到人類活動影響，又人為開發如水泥化等，導致適合產卵的地點不易覓得，讓母龜停留岸上的時間更長，增加路殺的風險，也就是遭車輛撞擊輾壓死亡的機會。',
  frog: '每年10月梭德氏赤蛙繁殖期，必須從山壁到溪底交配產卵。因為其體型較小，顏色不明顯，駕駛往往難以看見牠們，往往造成梭德氏赤蛙橫死輪下。根據路殺社統計，有97.4%的梭德氏樹蛙路殺事件發生在秋季。',
  pangolin: '在過去穿山甲經常入藥使用，其外皮質地堅韌，市場行情比鱷魚皮還高級。喜好奇珍異獸的富人認為穿山甲還能帶來福氣與財運。傳統的迷信與錯誤的迷思，讓穿山甲承受龐大的獵捕壓力。一身堅硬外皮是牠唯一的防禦技能，然而，其一身的鱗甲其實敵不過流浪狗的牙齒，許多穿山甲會被遭到被棄養的犬隻攻擊，或被咬死、或成為無尾的穿山甲而無法育雛。不只獵捕和流浪貓狗的啃咬引發滅絕問題，夜間行動的穿山甲同樣是遭路殺的常客，使得族群繁衍雪上加霜。'
}

export { tips_obj }