/*圖鑑的字*/

const response = [{
  "name": "領角鴞",
  "sciName": "Otus lettia",
  "imgSrc": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Collared_Scops_Owl%28Otus_lettia%29_by_Jack_Walf_.jpg/1280px-Collared_Scops_Owl%28Otus_lettia%29_by_Jack_Walf_.jpg",
  "description": "曾經在台大鹿鳴堂築巢、吸引大量賞鳥者的觀賞的領角鴞，或許是大家最為熟知的都會貓頭鷹之一。<br>牠們的活動環境和都市重疊，卻不像麻雀或鴿子會築巢，隨著都市宜居的樹洞和樹屋漸少，在缺乏天然的住所下，甚至可能會居住到房子的排油煙管。<br>牠們身長23cm~25cm，是一種小型鳥類，雖然是角鴞屬中體型最大的，但相較於其他猛禽來說相當嬌小。與角鴞屬其他鳥類類似，具小型像貓咪耳朵的耳羽簇，但牠們真正的「耳朵」其實是位於頭的兩側，撥開羽毛就能看到耳洞，兩邊的耳洞高低不一，藉著聲音傳達到兩個耳洞的時間差來判斷獵物位置。<br>為什麼領角鴞會飛，還是會被路殺呢？這是因為領角鴞的起飛角度較低，無法垂直起飛，因此在飛越馬路時，還沒飛到很高的高度就被車撞死了；另一方面，牠們的幼鳥在學飛階段很容易掉落在地上，又因飛行能力不佳，於是成為車下亡魂。",
},
{
  "name": "穿山甲",
  "sciName": "Manis pentadactyla",
  "imgSrc": "https://upload.wikimedia.org/wikipedia/commons/9/94/Manis_pentadactyla_%2829054818144%29.jpg",
  "description": "臺灣穿山甲屬於中國穿山甲的一支，是臺灣特有亞種。體長44~56公分，尾長30~40公分，體重約3~6.5公斤。頭部呈圓錐狀，吻部較尖。眼小，虹彩為黑色，腹面淡紅色。口無牙，具長型舌頭，舌長可達20公分。除鼻部、腹面及四肢內側外，全身布滿灰色鱗片，遇敵時會蜷縮成球狀。以螞蟻及白蟻為主食，以長舌黏取吞食。善挖洞，白天休憩於洞穴中，夜晚覓食。穿山甲除了繁殖季節雌雄會同居一穴外，其他時間都獨居生活。小穿山甲出生後會攀爬在母體的尾巴上，約5~6個月大後獨立生活。<br>在過去穿山甲經常入藥使用，其外皮質地堅韌，市場行情比鱷魚皮還高級，可以製成皮帶、皮夾、皮鞋等奢侈品；喜好奇珍異獸的富人認為，穿山甲做成標本當作店內擺飾，還能帶來福氣與財運。傳統的迷信與錯誤的迷思，讓穿山甲承受龐大的獵捕壓力。一身堅硬外皮是牠唯一的防禦技能，然而，其一身的鱗甲其實敵不過流浪狗的牙齒，許多穿山甲會被遭到被棄養的犬隻攻擊，或被咬死、或成為無尾的穿山甲而無法育雛。<br>不只獵捕和流浪貓狗的啃咬引發滅絕問題，夜間行動的穿山甲同樣是遭路殺的常客，使得族群繁衍雪上加霜。",
},
{
  "name": "石虎",
  "sciName": "Prionailurus bengalensis",
  "imgSrc": "https://web3.nmns.edu.tw/Exhibits/107/LeopardCat/assets/images/in-cont-3-1200x800.jpg",
  "description": "石虎的體型和外貌和虎斑貓相當類似，因此常被人誤認成野貓而帶回家飼養。事實上，石虎有一些相當獨特的特徵，最顯著的即是石虎耳後為黑底白紋，兩眼間亦有白色條紋，伴隨黑色條紋往頭頂延伸，身上具有類似豹紋的塊狀斑點。兩耳頂端通常較圓，叫聲較低沈，而且不會像家貓一樣以沙土覆蓋自己的排泄物。<br>台灣石虎是亞洲豹貓的12個亞種之一，曾在台灣普遍分布於全島低海拔山區，然而隨著開發，逐漸減少到剩下苗栗縣、台中市和南投縣仍有石虎的紀錄。<br>臺灣原來存在著兩種貓科動物：雲豹和石虎，然雲豹已滅絕，因此石虎成為台灣最後的野生貓科動物，然而，石虎會偷吃農民飼養的雞隻，也會阻礙當地的開發，因此在石虎議題不顯前，農民經常會設下陷阱傷害「害獸」石虎。<br>如今，由於道路開入淺山地區，使得石虎有機會進入路面並遭到車輛撞擊。在遍布丘陵地、石虎數量較多的苗栗縣，就經常發生石虎車禍致死事件。公路單位已在高速公路特定路段設置隔離網和生態廊道，但在一般道路上，石虎路死事件仍層出不窮。對於數量稀少的石虎來說，每一次事件都是重大損失，僅剩不到500隻的族群數量，專家預估會在百年內滅絕，步上台灣雲豹的後塵。",
},
{
  "name": "梭德氏樹蛙",
  "sciName": "Rana sauteri",
  "imgSrc": "https://upload.wikimedia.org/wikipedia/commons/a/a7/Rana_sauteri_20121103.jpg",
  "description": "梭德氏樹蛙呈灰褐色，大小約4至6公分，鼓膜周圍菱形斑明顯，背部有八字形黑斑，具背側褶，指趾端有吸盤狀，其蝌蚪為褐色，口腹部凹陷具吸盤狀。棲息於山區森林的溪流中。以溪流的石頭底下為產卵場。卵成團狀聚集。蝌蚪主食為藻類、落葉；成蛙主食為小型無脊椎動物。廣泛分布在海拔2500公尺以下山區，最高可達海拔3300公尺。<br>在溪流繁殖，叫聲往往被流水聲蓋住，所以雄蛙沒有外鳴囊，不以叫聲來吸引雌蛙接近，而採用主動搜索的方式，抱住身旁大小看起來像雌蛙的個體，然後再發出細細柔柔的求偶叫聲「嘖」表明心意。可是雌蛙的數目實在太少了，經常一、二百隻雄蛙搶幾十隻雌蛙，所以心急的雄蛙常常不小心抱到隔壁的雄蛙。牠們很盲從，只要有一隻雄蛙展開行動，周圍的雄蛙馬上會不甘勢弱、不明究理的跟進，因此常看到一堆雄蛙莫名其妙的爭成一團。等到被抱錯的雄蛙發出「給」釋放叫聲，告訴對方我也是公的時候，大家才會一哄而散，繼續尋找下一個目標。卵塊呈球狀有黏性，經常黏在石頭底下。蝌蚪腹面有吸盤，幫助牠們適應溪流生活。<br>每年10月梭德氏赤蛙繁殖期，必須從山壁到溪底交配產卵。因為其體型較小，顏色不明顯，駕駛往往難以看見牠們，往往造成梭德氏赤蛙橫死輪下。根據路殺社統計，有97.4%的梭德氏樹蛙路殺事件發生在秋季，顯示牠們的死亡和繁殖季息息相關。",
},
{
  "name": "斑龜",
  "sciName": "Mauremys sinensis",
  "imgSrc": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Ocadia_sinensis.jpg/1280px-Ocadia_sinensis.jpg",
  "description": "斑龜為臺灣淡水龜類，外觀特徵為頭頸、四肢以及尾部皆有黃綠線條，幼體背甲有3條淡褐色稜脊，隨著成長會漸漸轉為灰黑或黑褐色。因幼體尾巴長，又稱長尾龜，其他別名還有臺灣龜、水龜及中華花龜等。斑龜是臺灣體型最大的淡水龜，雌龜體型較大，背甲可長達27公分，雄龜背甲約20公分。4-6月為繁殖季，雌龜在產卵時才會上岸。交配後的雌龜會爬上岸尋找適合產卵的鬆軟沙地，從挖坑、產卵、埋卵，要花好幾個鐘頭。雌龜產完卵常會在岸上停留一段時間，再回到池中。因為斑龜生活區域常與人類活動區域重疊，很容易受到人類活動影響，又人為開發如水泥化等，導致適合產卵的地點不易覓得，讓母龜停留岸上的時間更長，增加路殺的風險，也就是遭車輛撞擊輾壓死亡的機會。<br>由於斑龜食物種類多樣，包括水生小型動物、水生植物、岸邊植物、蚯蚓等，能適應各種生活環境，其分布範圍相當廣，除常見野生斑龜之外，飼養於寺廟水池的也非常多，也因此無法有效設置警示立牌，只能靠駕駛多注意。<br>龜類雖然成體存活率很高，但幼體存活率很低，要達到成熟的時間較長，因而族群成長慢，若是繁殖母龜與幼龜數量減少，對斑龜族群的傷害可以見得。然而，雌龜在產卵期間以及幼龜孵化後回到水域的階段，恰巧都是斑龜最可能會遭遇路殺的時間，因此成為台江國家公園爬蟲類中最常被路殺的物種。",
},
{
  "name": "奧氏後相手蟹",
  "sciName": "Metasesarma aubryi",
  "imgSrc": "https://roadkill.tw/sites/dproadkill/files/content/p1130866.jpg",
  "description": "奧氏後相手蟹在綠島、墾丁都有牠的蹤跡，綠島本地人稱牠「白眉毛」（閩南語），主要棲息在海岸灌木叢至海岸林底層間。甲身隆起呈方形，甲面光滑，長約寬2公分，相當迷你。兩眼間有似眉之黃色條紋（有些無眉紋），螯足等大，各步足長有剛毛。甲殼呈黑褐色，兩螯為紅棕色，步足顏色較甲色淡。<br>繁殖季受雨季及月亮影響，每年農曆5~9月期間，每月月底的23至29日會有大量聚集降海釋幼行為，在墾丁香蕉灣、港口溪溪口及綠島龜灣，都是主要受路殺威脅的物種。釋幼行為主要發生於清晨天未亮前及黃昏日落後的幾小時內。<br>母蟹待卵成熟時，依著月亮潮汐決定釋幼時間，此時，母蟹會抱著許多卵橫跨馬路，從山邊走向海岸「釋幼」，滿抱著卵的母蟹，只要一碰到海水就會一直抖動，破卵而出的小螃蟹們便會誕生，像是在海裡開花一般，所以又稱「洗花」（閩南語），由於體積小，又在夜晚出沒，遊客一不注意便會壓死這些陸蟹，在2014年7月21日，在短短50公尺的路上，就有2,247隻陸蟹遭壓死。",
},
{
  "name": "小紫斑蝶",
  "sciName": "Euploea tulliolus",
  "imgSrc": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/Euploea_tulliolus_koxinga_ventral_view_20150202.jpg/1280px-Euploea_tulliolus_koxinga_ventral_view_20150202.jpg",
  "description": "小紫斑蝶是茂林最常見的蝴蝶，主要分布在南台灣低海拔山區，中北部及東部低海拔山區亦有一些族群量，展翅約5~7公分。前翅腹面中央有一枚白色斑點，體型是台灣產紫斑蝶屬中最小，翅形近似圓翅紫斑蝶，雄蝶前後緣呈弧形突出，後翅背面中室附近有一片灰褐色性斑；雌蝶前翅後緣則呈一直線。<br>台灣的紫斑蝶與墨西哥帝王斑蝶並列世界兩大越冬型蝶種，當發生多種斑蝶群聚越冬的現象時，便會被稱為「紫蝶幽谷」。紫斑蝶屬於熱帶蝶種，活動溫度在15°C以上，而台灣正是全世界紫斑蝶分布最北的國家。台灣以南的國家，冬天不冷，紫斑蝶不需要遷移，而北迴歸線將台灣劃分成熱帶與亞熱帶氣候，形成了台灣紫斑蝶南下度冬的獨特現象，形成了壯觀的「紫蝶幽谷」。<br>每年紫斑蝶會依循固定路線離開越冬棲地，從茂林開始，經過寶來、月世界、台南曾文水庫、台南關子嶺、茶山、達娜伊谷、石桌、雲林林內鄉、彰化八卦山、台中大肚山、再到苗栗竹南海邊，路線卻正好與國道三號垂直相交，北徙季節又恰逢清明連假，因此常常傷亡慘重。",
},
{
  "name": "白鼻心",
  "sciName": "Paguma larvata",
  "imgSrc": "https://np.cpami.gov.tw/filesys/image/01_chinese/03_conservation/result/20090909_conservation_02.jpg",
  "description": "白鼻心，又稱為白鼻貓、果子狸、烏腳香、茅尾黑腳貓，肛門附近具臭腺，遇敵時會釋出異味驅之，後腳底也有腺體，行走時可沿途留下氣味標記，此為別名「烏腳香」之由來。<br>外觀和鼬、貂相似，不過其臉上白線是連起來的， 身體呈現黑灰色。 眼下及耳下具白斑、鼻子是淡粉紅色。全身大致為灰褐色，腹部顏色較淡，但頸、肩、喉部為黑色，身體末梢如四肢末端及尾巴末端也都呈現黑色。四肢短壯各具五趾，平均身體長度在48～50公分，尾長37～41公分。<br>白鼻心雖屬於食肉目動物卻偏食果性動物，多以核果、漿果為食，會隨著不同果樹成熟季節而移動。<br>白鼻心主要棲息在中低海拔常綠闊葉林或森林邊緣，經常可見利用溪谷兩岸或路邊乾溪溝行走。白天大多穴居於中空的倒木或岩洞。<br>白鼻心頗能適應人為干擾，因此偶爾也能在都市、平地見到牠們的身影，因此也成為遭路殺常見的物種之一。",
},
{
  "name": "鼬獾",
  "sciName": "Melogale moschata",
  "imgSrc": "https://upload.wikimedia.org/wikipedia/commons/3/3d/Melogale_moschata_%28male%29_Praha_zoo_02.2011_01.jpg",
  "description": "鼬獾是屬於食肉目貂科的成員，是台灣的特有亞種。由於黑白斑紋對比明顯，在額頭至眼睛周圍有明顯的白毛，形成神似國劇人物的化妝臉譜，故也有「花臉貍」之稱，而他那長長的小豬鼻也讓他有另一個可愛的稱號「小豚貓」。和白鼻心不同的地方在於，其臉上的白線是斷開的， 身體呈現棕黑色。<br>白天躲藏於樹洞、土洞或岩洞內休息，日落黃昏後始外出覓食。有爬樹能力，但不常上樹活動；行動緩慢，不善跳躍。主要以嗅覺找尋食物，但聽力與觸覺亦佳，喜好捕食蜥蜴、鳥類、小型囓齒類，對於蝸牛、蚯蚓、大型昆蟲等無脊椎動物也來者不拒，有時亦會取食植物果實。排遺呈黑色細長螺旋狀，是明顯易辨的跡相。由於臭腺特別發達，受驚嚇或被逼迫時亦會分泌具惡臭之氣味以驅敵。每年5～6月為其生殖高峰期，通常每胎產1～3隻幼獸。<br>過去曾因狂犬病暴發，遭民眾人人喊打，許多無辜的鼬獾成為棒下亡魂。",
},

];



const animalList = {0: "owl", 1: "manis", 2: "leopardCat", 3:"frog", 4:"turtle", 5:"crab", 6:"butterfly", 7:"paguma", 8: "melogale"};

/*找key*/
function getKeyByValue(object, value) {
  return Object.keys(object).find(key => object[key] === value);
}


/*有幾個動物就創幾隻*/
function Bot(i, name, response) {
  this.i = i;
  this.name = name;
  this.response = response;
};


function makeBots(n, animalList) {
  var bots = new Array(n);
  for (var i = 0; i < n; ++i) {
    bots[i] = new Bot(i, animalList[i], response[i]);
  }
  return bots;
}
var animalInfo = makeBots(Object.keys(animalList).length, animalList);
console.log(animalInfo)


const modalTitle = document.getElementById("ModalLabel");
const modalSciName = document.getElementById("ModalSciName");
const modalImage = document.getElementById("ModalImage");
const modalContent = document.getElementById("ModalContent");

function popUp(href_id) {
    var animalNo = getKeyByValue(animalList, href_id);
    modalTitle.innerHTML = animalInfo[animalNo].response.name;
    modalSciName.innerHTML = "(" + animalInfo[animalNo].response.sciName + ")";
    modalImage.src = animalInfo[animalNo].response.imgSrc;

    modalContent.innerHTML = animalInfo[animalNo].response.description;
}
